# GetFilterVisibility Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
View..::..GetFilterVisibility Method
View Class See Also
---
Gets the visibility of the elements associated with a filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool GetFilterVisibility(
	ElementId filterElementId
)
```

Visual Basic
---
```text
Public Function GetFilterVisibility ( _
	filterElementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool GetFilterVisibility(
	ElementId^ filterElementId
)
```

# ### Parameters
filterElementId
    Type: Autodesk.Revit.DB..::..ElementId The ElementId of the filter.
# ### Return Value
True if the elements associated with the filter are visible in the view, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Filter is not applied to the view. -or- ElementId is not associated with a FilterElement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also
View Class
Autodesk.Revit.DB Namespace